# AnalysisDisplayMarkersAndTextSettings Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayMarkersAndTextSettings Constructor
AnalysisDisplayMarkersAndTextSettings Class See Also
---
Constructs a default instance of markers and text settings.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public AnalysisDisplayMarkersAndTextSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
AnalysisDisplayMarkersAndTextSettings()
```

# See Also
AnalysisDisplayMarkersAndTextSettings Class
AnalysisDisplayMarkersAndTextSettings Overload
Autodesk.Revit.DB.Analysis Namespace